glcloud/keil_v5/ARM/PACK/.Web/TexasInstruments.MSP432P4xx_DFP.pdsc
          <!-- ***********************Enable Trace******************************* -->
          <!-- TraceStart: Set PJ.5 as SWO by setting function select registers(PJSEL0 and PJSEL1) -->
        <sequence name="TraceStart">
          <block>
            __var value      = 0;

            //Enable SWO 
            value = Read8(0x40004D2A);
            Write8(0x40004D2A, (value | 0x20));         //Set the register PJSEL0.5=1
            value = Read8(0x40004D2C);
            Write8(0x40004D2C, (value &amp; (~0x20)));  //Clear the register PJSEL1.5=0 
          </block>
        </sequence>     
        <!-- TraceStop: Set function select registers(PJSEL0 and PJSEL1) to default value-->
        <sequence name="TraceStop">
          <block>
            __var value      = 0;

            //Set PJ.5 pin functionality as default(TD0/SWO Mode)
            value = Read8(0x40004D2A);
            Write8(0x40004D2A, (value | 0x20));         //Set the register PJSEL0.5=1
            value = Read8(0x40004D2C);
            Write8(0x40004D2C, (value &amp; (~0x20)));  //Clear the register PJSEL1.5=0 
          </block>
        </sequence>
      </sequences>
      
      <environment name="iar">
          <compile    define="ewarm"/><!-- needed for driver library -->
      </environment>
        
      <!-- ************************  Subfamily MSP432P4xx  **************************** -->
      <subFamily DsubFamily="MSP432P4xx">
        <processor  Dclock="48000000"/>
        <book name="http://www.ti.com/lit/pdf/slas826" title="MSP432P4xx Datasheet"/>
        <book name="http://www.keil.com/appnotes/docs/apnt_276.asp" title="Keil Examples"/>

        <!-- features common for the sub family -->
        <feature type="PowerOther" n="1" name="Active Mode 90 &#181;A/MHz"/>
        <feature type="PowerOther" n="1" name="Low-Frequency Active: 90 &#181;A (at 128 kHz)"/>
        <feature type="PowerOther" n="1" name="LPM3 (With RTC): 850 nA"/>
        <feature type="PowerOther" n="1" name="LPM3.5 (With RTC): 800 nA"/>
        <feature type="PowerOther" n="1" name="LPM4.5: 25 nA"/>

        <compile    header="Device/Include/msp.h"/>

        <!-- *************************  Device MSP432P401R  ***************************** -->
        <device Dname="MSP432P401R">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00004000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00010000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00010000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash256kB.FLM" start="0x00000000" size="0x00040000" RAMstart="0x01000000" RAMsize="0x0000E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash.FLM"      start="0x00200000" size="0x00004000" RAMstart="0x01000000" RAMsize="0x0000E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P401R.flash"        start="0x00000000" size="0x00040000" RAMstart="0x01000000" RAMsize="0x0000E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P401R_info.flash"   start="0x00200000" size="0x00004000" RAMstart="0x01000000" RAMsize="0x0000E000" default="0" style="IAR"/>
          <compile    define="__MSP432P401R__"/>
          <debug      svd="SVD/MSP432P401R.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P401M  ***************************** -->
        <device Dname="MSP432P401M">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00004000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00008000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00008000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash128kB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x01000000" RAMsize="0x00006000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash.FLM"      start="0x00200000" size="0x00004000" RAMstart="0x01000000" RAMsize="0x00006000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P401M.flash"        start="0x00000000" size="0x00020000" RAMstart="0x01000000" RAMsize="0x00006000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P401M_info.flash"   start="0x00200000" size="0x00004000" RAMstart="0x01000000" RAMsize="0x00006000" default="0" style="IAR"/>
          <compile    define="__MSP432P401M__"/>
          <debug      svd="SVD/MSP432P401M.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P4111  ***************************** -->
        <device Dname="MSP432P4111">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00200000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00040000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00040000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash2048kB.FLM" start="0x00000000" size="0x00200000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash_A.FLM"     start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P4111.flash"        start="0x00000000" size="0x00200000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P4111_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <compile    define="__MSP432P4111__"/>
          <debug      svd="SVD/MSP432P4111.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
