glcloud/keil_v5/ARM/PACK/.Web/TexasInstruments.MSP432P4xx_DFP.pdsc
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P401R">
      <description>System Startup for MSP432P401R</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401r_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401r_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p401r.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401r_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p401r.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P401M">
      <description>System Startup for MSP432P401M</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401m_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401m_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p401m.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401m_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p401m.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P4111">
      <description>System Startup for MSP432P4111</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4111_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4111_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p4111.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4111_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p4111.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P411Y">
      <description>System Startup for MSP432P411Y</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411y_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411y_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p411y.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411y_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p411y.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P411V">
      <description>System Startup for MSP432P411V</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411v_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411v_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p411v.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p411v_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p411v.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
