glcloud/keil_v5/ARM/PACK/.Web/TexasInstruments.MSP432P4xx_DFP.pdsc
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P4011">
      <description>System Startup for MSP432P4011</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4011_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4011_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p4011.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p4011_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p4011.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P401Y">
      <description>System Startup for MSP432P401Y</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401y_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401y_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p401y.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401y_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p401y.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.2" condition="isMSP432P401V">
      <description>System Startup for MSP432P401V</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="header"  name="Device/Include/msp_compatibility.h" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401v_uvision.s" attr="config" condition="Startup ARM" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401v_gcc.S" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="linkerScript"  name="Device/Source/msp432p401v.ld" attr="config" condition="Startup GCC" version="3.2.2"/>
        <file category="source"  name="Device/Source/startup_msp432p401v_ewarm.c" attr="config" condition="Startup IAR" version="3.2.2"/>
        <file category="source"  name="Device/Source/system_msp432p401v.c" attr="config" version="3.2.2"/>
        <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="3.2.2"/>
        <file category="source"  name="Examples/BlinkLED/blinkLED.c" attr="template" select="BlinkLED example" version="3.2.2"/>
      </files>
    </component>
  </components>

  <boards>
  <board vendor="TexasInstruments" name="MSP-EXP432P401R" salesContact="http://www.ti.com/general/docs/contact.tsp" orderForm="https://store.ti.com/msp-exp432p401r.aspx">
    <description>MSP432P401R LaunchPad</description>
    <image large="http://www.ti.com/diagrams/med_msp-exp432p401r_msp-exp432p401r_sidered.jpg" public="true" />
    <book category="overview"  name="http://www.ti.com/tool/msp-exp432p401r" title="MSP432P401R LaunchPad Web page"/>
    <book category="setup"     name="http://www.ti.com/lit/pdf/slau596" title="MSP432 Quick Start Guide"/>
    <book category="manual"    name="http://www.ti.com/lit/pdf/slau597" title="LaunchPad Development Kit User's Guide"/>
    <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P401R"/>
    <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dfamily="MSP432P4xx Series" DsubFamily="MSP432P4xx"/>
    <debugInterface adapter="XDS110-ET" connector="XDS110-ET Onboard Emulator"/>  
    <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
    <feature type="USB" n="1" name="USB Device,  Micro-B receptacle"/>
    <feature type="Button" n="3" name="reset and tow user push-buttons"/>
    <feature type="LED" n="2" name="LEDs for user interaction"/>    
    <feature type="ConnOther" n="1" name="40 pin BoosterPack Connector and support for 20 pin BoosterPacks"/>
    <feature type="Other" n="1" name="Back-channel UART via USB to PC"/>
    <feature type="ODbg" n="1" name="Onboard XDS-110ET emulator featuring EnergyTrace+ Technology"/>
  </board>
  <board vendor="TexasInstruments" name="MSP-EXP432P4111" salesContact="http://www.ti.com/general/docs/contact.tsp" orderForm="https://store.ti.com/MSP-EXP432P4111-SimpleLink-MSP432P4111-MCU-LaunchPad-Development-Kit-P53210.aspx">
    <description>MSP432P401R LaunchPad</description>
    <image large="http://www.ti.com/diagrams/med_msp-exp432p4111_msp-exp432_p4111.jpg" public="true" />
    <book category="overview"  name="http://www.ti.com/tool/msp-exp432p4111" title="MSP432P4111 LaunchPad Web page"/>
    <book category="manual"    name="http://www.ti.com/lit/pdf/slau747" title="LaunchPad Development Kit User's Guide"/>
    <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P4111"/>
    <debugInterface adapter="XDS110-ET" connector="XDS110-ET Onboard Emulator"/>  
    <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
    <feature type="LCD" n="1" name="Segment LCD Controller"/>
    <feature type="USB" n="1" name="USB Device,  Micro-B receptacle"/>
    <feature type="Button" n="3" name="reset and tow user push-buttons"/>
    <feature type="LED" n="2" name="LEDs for user interaction"/>    
    <feature type="ConnOther" n="1" name="40 pin BoosterPack Connector and support for 20 pin BoosterPacks"/>
    <feature type="Other" n="1" name="Back-channel UART via USB to PC"/>
    <feature type="ODbg" n="1" name="Onboard XDS-110ET emulator featuring EnergyTrace+ Technology"/>
  </board>
  <board vendor="TexasInstruments" name="MSP-TS432PZ100" salesContact="http://www.ti.com/general/docs/contact.tsp" orderForm="https://store.ti.com/msp-ts432pz100.aspx">
    <description>MSP432 100-Pin Target board</description>
    <image large="http://www.ti.com/diagrams/med_msp-ts432pz100_msp-ts432pz100-board-photo.jpg" public="true" />
    <mountedDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P401R"/>
    <mountedDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P401M"/>
    <mountedDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P4111"/>
    <mountedDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P411Y"/>
    <mountedDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSP432P411V"/>
    <book category="manual" name="http://www.ti.com/lit/pdf/slau571" title="MSP432 Hardware Tools User's Guide"/>
        <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dfamily="MSP432P4xx Series" DsubFamily="MSP432P4xx"/> 
    <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector (0.1 inch connector)"/>
    <feature type="ConnOther" n="1" name="BSL programming connector"/>  
    <feature type="Button" n="2" name="reset and user"/>
  </board>
  </boards>

    <examples>
    <example name="BlinkLED" folder="Examples/BlinkLED" doc="Abstract.txt" version="3.2.2">
    <description>This is a basic example demonstrating the development flow and making the LED on the board blink</description>
    <board name="MSP-EXP432P401R" vendor="TexasInstruments"/>
    <project>
      <environment name="uv"  load="ARM/BlinkLED.uvprojx"/>
          <environment name="iar" load="IAR/BlinkLED/BlinkLED.ewp" />
          <environment name="atollic" load="Atollic/.project" />
    </project>
    <attributes>
      <component Cclass="CMSIS" Cgroup="CORE"/>
      <component Cclass="Device" Cgroup="Startup"/>
      <keyword>Blinky</keyword>
      <keyword>Getting Started</keyword>
    </attributes>
    </example>
    <example name="EmptyMain" folder="Examples/EmptyMain" doc="Abstract.txt" version="3.2.2">
    <description>This is a basic example providing an empty main body</description>
    <board name="MSP-EXP432P401R" vendor="TexasInstruments"/>
    <project>
      <environment name="uv"  load="ARM/EmptyMain.uvprojx"/>
      <environment name="iar" load="IAR/EmptyMain/EmptyMain.ewp" />
      <environment name="atollic" load="Atollic/.project" />
    </project>
    <attributes>
      <component Cclass="CMSIS" Cgroup="CORE"/>
      <component Cclass="Device" Cgroup="Startup"/>
      <keyword>Empty</keyword>
      <keyword>Main</keyword>
      <keyword>Getting Started</keyword>
    </attributes>
    </example>
  </examples>
</package>
